'use script';
let a = 1;
let b = 2;
const num = 1;

// Якщо змінна a дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Неправильно'.
a === 0 ? console.log('Вірно') : console.log('Не вірно');

// Якщо змінна a більша за нуль, то виведіть 'Вірно', інакше виведіть 'Невірно'.
a > 0 ? console.log('Вірно') : console.log('Не вірно');

// Якщо змінна a менша за нуль, то виведіть 'Вірно', інакше виведіть 'Невірно'.
a < 0 ? console.log('Вірно') : console.log('Не вірно');

// Якщо змінна a більша або дорівнює нулю, то виведіть 'Вірно', інакше виведіть 'Неправильно'.
a >= 0 ? console.log('Вірно') : console.log('Не вірно');

// Якщо змінна a менша або дорівнює нулю, то виведіть 'Вірно', інакше виведіть 'Неправильно'.
a <= 0 ? console.log('Вірно') : console.log('Не вірно');

// Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
a !== 0 ? console.log('Вірно') : console.log('Не вірно');

// Якщо змінна a дорівнює 'test', виведіть 'Вірно', інакше виведіть 'Неправильно'.
a === 'test' ? console.log('Вірно') : console.log('Не вірно');

// Якщо змінна a дорівнює '1' і за значенням і типом, то виведіть 'Вірно', інакше виведіть 'Невірно'.
a === '1' ? console.log('Вірно') : console.log('Не вірно');

// Якщо змінна a більша за нуль і менше 5-ти, то виведіть 'Вірно', інакше виведіть 'Невірно'.
a > 0 && a < 5 ? console.log('Вірно') : console.log('Не вірно');

// Якщо змінна a дорівнює нулю або дорівнює двом, додайте до неї 7, інакше поділіть її на 10. Виведіть нове значення змінної на екран.
a === 0 || a === 2 ? (a += 7) : (a /= 10);
console.log(a);

// Якщо змінна a дорівнює або менше 1, а змінна b більша або дорівнює 3, то виведіть суму цих змінних, інакше виведіть їх різницю (результат віднімання).
a <= 1 && b >= 3 ? console.log(a + b) : console.log(a - b);

// Якщо змінна a більше 2-х і менше 11-ти, або змінна b більша або дорівнює 6-ти і менше 14-ти, то виведіть 'Вірно', інакше виведіть 'Невірно'.
(a > 2 && a < 11) || (b >= 6 && b <= 14)
  ? console.log('Вірно')
  : console.log('Невірно');

// Змінна num може приймати 4 значення: 1, 2, 3 або 4. Якщо вона має значення 1, то в змінну result запишемо зима, якщо має значення 2 - весна і так далі. Розв'яжіть завдання через switch-case.
let result = null;
switch (num) {
  case 1:
    result = 'Зима';
    break;
  case 2:
    result = 'Весна';
    break;
  case 3:
    result = 'Літо';
    break;
  case 4:
    result = 'Осінь';
    break;
  default:
    result = 'Шось не те';
    break;
}
console.log(result);
