'use strict';
// 1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
const arr = [];
for (let i = 20; i <= 30; i += 0.5) arr.push(i);

console.log(arr.join(','));

// 2. Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
arr.length = 0;
for (let i = 10; i <= 100; i += 10) arr.push(i * 27);

console.log(arr.join(','));

// 3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
arr.length = 0;
let num = 1200;
for (let i = 1; i < 100; i++) {
  if (i ** 2 > num) break;
  arr.push(i);
}
console.log(arr.join(','));

// 4. Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
num = 4;
let isSimple = true;
for (let i = 1; i <= num; i++) {
  if (num % i === 0 && i !== 1 && i !== num) {
    isSimple = false;
    break;
  }
}
console.log(`${num} ${isSimple ? 'просте' : 'не просте'}`);

// 5. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
num = 13;
let flag = false;
for (let i = 1; i <= num; i++) {
  if (3 ** i === num) {
    flag = true;
    break;
  }
}
console.log(
  `${num} ${
    flag
      ? 'можна отримати піднесши 3 у степінь'
      : 'не можна отримати піднесши 3 у степінь'
  }`
);
