'use strict';
// 1. Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
const t1Arr1 = [1, 2, 3];
const t1Arr2 = [4, 5, 6];
const task1 = t1Arr1.concat(t1Arr2);
console.log(task1);

// 2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
const t2Arr1 = [1, 2, 3];
const task2 = t2Arr1.reverse();
console.log(task2);

// 3. Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
const t3Arr1 = [1, 2, 3];
t3Arr1.push(4);
t3Arr1.push(5);
t3Arr1.push(6);
console.log(t3Arr1);

// 4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
const t4Arr1 = [1, 2, 3];
t4Arr1.unshift(4);
t4Arr1.unshift(5);
t4Arr1.unshift(6);
console.log(t4Arr1);

// 5. Дан массив ['js',"css', 'jq']. Выведите на экран первый элемент.
const t5Arr1 = ['js', 'css', 'jq'];
console.log(t5Arr1.at(0), t5Arr1[0]);

// 6. Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.
const t6Arr1 = ['js', 'css', 'jq'];
console.log(t5Arr1.at(-1), t5Arr1[t5Arr1.length - 1]);

// 7. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [1, 2, 3].
const t7Arr1 = [1, 2, 3, 4, 5];
const task7 = t7Arr1.slice(0, 3);
console.log(task7);

// 8. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [4, 5].
const t8Arr1 = [1, 2, 3, 4, 5];
const task8 = t8Arr1.slice(-2);
console.log(task8);

// 9. Дан массив [1, 2, 3, 4, 5]. С помощью метода преобразуйте массив в [1, 4, 5].
const task9 = [1, 2, 3, 4, 5];
task9.splice(1, 2);
console.log(task9);

// 10. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [2, 3, 4].
const t10Arr1 = [1, 2, 3, 4, 5];
const task10 = t10Arr1.slice(1, -1);
console.log(task10);

// 11. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
const task11 = [1, 2, 3, 4, 5];
task11.splice(3, 0, 'a', 'b', 'c');
console.log(task11);

// 12. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
const task12 = [1, 2, 3, 4, 5];
task12.splice(1, 0, 'a', 'b');
task12.splice(6, 0, 'c');
task12.push('e');
console.log(task12);

// 13. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.
const task13 = [3, 4, 1, 2, 7];
console.log(task13.sort());

// 14. Дан массив с числами [5, 6, 7, 8, 9]. Найдите сумму этих чисел.
const task14 = [5, 6, 7, 8, 9];
console.log(task14.reduce((acc, cur) => acc + cur, 0));

// 15. Дан массив с числами [5, 6, 7, 8, 9]. Сделайте из него массив, состоящий из квадратов этих чисел.
const t15Arr1 = [5, 6, 7, 8, 9];
const task15 = t15Arr1.map((el) => el ** 2);
console.log(task15);

// 16. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только отрицательные числа.
const task16 = [1, -3, 5, 6, -7, 8, 9, -11];
console.log(task16.filter((el) => el < 0));

// 17. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только четные числа.
const task17 = [1, -3, 5, 6, -7, 8, 9, -11];
console.log(task17.filter((el) => el % 2 === 0));

// 18. Дан массив со строками ['aaa', 'aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q', 'az']. Оставьте в нем только те строки, длина которых больше 5-ти символов.
const task18 = ['aaa', 'aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q', 'az'];
console.log(task18.filter((el) => el.length > 5));

// 19. Дан массив, в нем могут быть обычные элементы и подмассивы, например [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только подмассивы.
const task19 = [1, 2, [3, 4], 5, [6, 7]];
console.log(task19.filter((el) => Array.isArray(el)));

// 20. Дан массив с числами [5,-3, 6,-5, 0,-7, 8, 9]. Посчитайте количество отрицательных чисел в этом массиве.
const task20 = [5, -3, 6, -5, 0, -7, 8, 9];
console.log(task20.reduce((acc, curr) => (curr < 0 ? acc + 1 : acc), 0));